{
  "_class_name": "NucleusMoEImageTransformer2DModel",
  "_diffusers_version": "0.38.0.dev0",
  "_name_or_path": "C:\\Users\\gabeg\\Projects\\nucleus-image\\Nucleus-Image_FP8",
  "attention_head_dim": 128,
  "axes_dims_rope": [
    16,
    56,
    56
  ],
  "capacity_factors": [
    0.0,
    0.0,
    0.0,
    4.0,
    4.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0,
    2.0
  ],
  "dense_moe_strategy": "leave_first_three_blocks_dense",
  "in_channels": 64,
  "joint_attention_dim": 4096,
  "mlp_ratio": 4.0,
  "moe_enabled": true,
  "moe_intermediate_dim": 1344,
  "num_attention_heads": 16,
  "num_experts": 64,
  "num_key_value_heads": 4,
  "num_layers": 32,
  "out_channels": 16,
  "patch_size": 2,
  "route_scale": 2.5,
  "use_grouped_mm": true,
  "use_sigmoid": false
}
